Documents/Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Производство</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОстаткиКЗ</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладСписанияСырья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступленияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемоеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическиВыпущено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляМасла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРозлива</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьКЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправкиОтчетаПоУКЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОтправкиОтчетаПоУКЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СырьеИМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратныеОтходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВыхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольныеЗнаки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДвижениеКонтрольныхЗнаков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыпуска</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВыпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнутреннееПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВнутреннееПеремещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОтпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПродукцияИСырье</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПартии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<BasedOn>
				<xr:Item>Document.Производство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиравшийПробу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаслоТехническое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пробы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРозлива</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВеличинаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПробы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПАНаОтборПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПА1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HTTPServices/ВыгрузкиДокументов/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ВыпускиПродукции(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	Если ИмяМетода <> "Period" Тогда 
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	Иначе 
		ДатаНачала = НачалоДня(Дата(Запрос.ПараметрыЗапроса.Получить("dn")));
		ДатаОкончания = КонецДня(Дата(Запрос.ПараметрыЗапроса.Получить("dk")));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Производство.ДатаРозлива <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Производство.ДатаРозлива
	|		ИНАЧЕ Производство.Дата
	|	КОНЕЦ КАК ДатаДокумента,
	|	Производство.ВидПродукции.Наименование КАК ВидПродукцииНаименование,
	|	Производство.СкладСписанияСырья.КодВ77 КАК СкладСписанияСырьяКодВ77,
	|	СУММА(ПроизводствоЭтапыПроизводства.КоличествоВыпуска) КАК КоличествоВыпуска,
	|	Производство.ВидПродукции.ВидНоменклатуры КАК ВидПродукцииВидНоменклатуры,
	|	Производство.Номер КАК Номер,
	|	Производство.ПризнакИзменения КАК ПризнакИзменения,
	|	Производство.Автор.Наименование КАК Ответсвенный
	|ИЗ
	|	Документ.Производство.ЭтапыПроизводства КАК ПроизводствоЭтапыПроизводства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Производство КАК Производство
	|		ПО ПроизводствоЭтапыПроизводства.Ссылка = Производство.Ссылка
	|ГДЕ
	|	Производство.Проведен = ИСТИНА
	|	И Производство.Дата >= &ДатаНачала
	|	И Производство.Дата <= &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	Производство.ВидПродукции.Наименование,
	|	Производство.ФактическиВыпущено,
	|	Производство.СкладСписанияСырья.КодВ77,
	|	ВЫБОР
	|		КОГДА Производство.ДатаРозлива <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Производство.ДатаРозлива
	|		ИНАЧЕ Производство.Дата
	|	КОНЕЦ,
	|	Производство.ВидПродукции.ВидНоменклатуры,
	|	Производство.Номер,
	|	Производство.ПризнакИзменения,
	|	Производство.Автор.Наименование";
	
	Запрос.Параметры.Вставить("ДатаНачала", ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку(); 
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина);
	МойXML.ЗаписатьОбъявлениеXML();
	
	ТипВсеДокументы = ФабрикаXDTO.Тип("http://www.sample-package.org","СписокПроизводство");
	ВсеДокументы = ФабрикаXDTO.Создать(ТипВсеДокументы);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипОдинДокумент = ФабрикаXDTO.Тип("http://www.sample-package.org","ДокументПроизводства");
		ОдинДокумент = ФабрикаXDTO.Создать(ТипОдинДокумент);
		ЗаполнитьЗначенияСвойств(ОдинДокумент, ВыборкаДетальныеЗаписи,,"ВидПродукцииВидНоменклатуры");
		ОдинДокумент.ВидПродукцииВидНоменклатуры = Строка(ВыборкаДетальныеЗаписи.ВидПродукцииВидНоменклатуры);
		ВсеДокументы.ДокументПроизводства.Добавить(ОдинДокумент);
	КонецЦикла;
	ФабрикаXDTO.ЗаписатьXML(МойXML, ВсеДокументы);
	СтрокаОтвета =  МойXML.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, "UTF-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/xml");
	Возврат Ответ;
КонецФункции

Функция ВнутренниеПеремещения(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	Если ИмяМетода <> "Period" Тогда 
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	Иначе 
		ДатаНачала = НачалоДня(Дата(Запрос.ПараметрыЗапроса.Получить("dn")));
		ДатаОкончания = КонецДня(Дата(Запрос.ПараметрыЗапроса.Получить("dk")));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПеремещениеПродукцияИСырье.Ссылка.Номер КАК НомерДокумента,
	|	ВнутреннееПеремещениеПродукцияИСырье.Ссылка.Дата КАК ДатаДокумента,
	|	ВнутреннееПеремещениеПродукцияИСырье.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ВнутреннееПеремещениеПродукцияИСырье.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	ВнутреннееПеремещениеПродукцияИСырье.Количество КАК Количество,
	|	ВнутреннееПеремещение.СкладОтправитель.КодВ77 КАК СкладОтправительКодВ77,
	|	ВнутреннееПеремещение.СкладПолучатель.КодВ77 КАК СкладПолучательКодВ77
	|ИЗ
	|	Документ.ВнутреннееПеремещение.ПродукцияИСырье КАК ВнутреннееПеремещениеПродукцияИСырье
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещение КАК ВнутреннееПеремещение
	|		ПО ВнутреннееПеремещениеПродукцияИСырье.Ссылка = ВнутреннееПеремещение.Ссылка
	|ГДЕ
	|	ВнутреннееПеремещение.Дата >= &ДатаНачала
	|	И ВнутреннееПеремещение.Дата <= &ДатаОкончания
	|	И ВнутреннееПеремещение.Проведен = ИСТИНА";
	
	Запрос.Параметры.Вставить("ДатаНачала", ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания", ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку(); 
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина);
	МойXML.ЗаписатьОбъявлениеXML();
	
	ТипВсеДокументы = ФабрикаXDTO.Тип("http://www.sample-package.org","СписокПеремещения");
	ВсеДокументы = ФабрикаXDTO.Создать(ТипВсеДокументы);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипОдинДокумент = ФабрикаXDTO.Тип("http://www.sample-package.org","ДокументПеремещения");
		ОдинДокумент = ФабрикаXDTO.Создать(ТипОдинДокумент);
		ЗаполнитьЗначенияСвойств(ОдинДокумент, ВыборкаДетальныеЗаписи,,"НоменклатураВидНоменклатуры");
		ОдинДокумент.НоменклатураВидНоменклатуры = Строка(ВыборкаДетальныеЗаписи.НоменклатураВидНоменклатуры);
		ВсеДокументы.ДокументПеремещения.Добавить(ОдинДокумент);
	КонецЦикла;
	ФабрикаXDTO.ЗаписатьXML(МойXML, ВсеДокументы);
	СтрокаОтвета =  МойXML.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, "UTF-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/xml");
	Возврат Ответ;
КонецФункции

Функция Трудозатраты(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	Если ИмяМетода <> "Period" Тогда 
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	Иначе 
		ДатаНачала = НачалоДня(Дата(Запрос.ПараметрыЗапроса.Получить("dn")));
		ДатаОкончания = КонецДня(Дата(Запрос.ПараметрыЗапроса.Получить("dk")));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетТрудозатрат.Ссылка КАК Ссылка,
		|	СУММА(УчетТрудозатратУчетЗатрат.ИтогоПоВиду) КАК Время,
		|	УчетТрудозатратУчетЗатрат.ВидТрудозатрат.Наименование КАК ВидТрудозатрат
		|ИЗ
		|	Документ.УчетТрудозатрат.УчетЗатрат КАК УчетТрудозатратУчетЗатрат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УчетТрудозатрат КАК УчетТрудозатрат
		|		ПО УчетТрудозатратУчетЗатрат.Ссылка = УчетТрудозатрат.Ссылка
		|ГДЕ
		|	УчетТрудозатрат.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УчетТрудозатрат.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетТрудозатрат.Ссылка,
		|	УчетТрудозатратУчетЗатрат.ВидТрудозатрат.Наименование";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Ложь", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку(); 
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина);
	МойXML.ЗаписатьОбъявлениеXML();
	
	ТипВсеДокументы = ФабрикаXDTO.Тип("http://www.sample-package.org","СписокТрудозатраты");
	ВсеДокументы = ФабрикаXDTO.Создать(ТипВсеДокументы);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипОдинДокумент = ФабрикаXDTO.Тип("http://www.sample-package.org","ДокументТрудозатрат");
		ОдинДокумент = ФабрикаXDTO.Создать(ТипОдинДокумент);
		ЗаполнитьЗначенияСвойств(ОдинДокумент, ВыборкаДетальныеЗаписи);
		ВсеДокументы.ДокументТрудозатрат.Добавить(ОдинДокумент);
	КонецЦикла;
	ФабрикаXDTO.ЗаписатьXML(МойXML, ВсеДокументы);
	СтрокаОтвета =  МойXML.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, "UTF-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/xml");
	Возврат Ответ;
КонецФункции

Функция Списание(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	Если ИмяМетода <> "Period" Тогда 
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	Иначе 
		ДатаНачала = НачалоДня(Дата(Запрос.ПараметрыЗапроса.Получить("dn")));
		ДатаОкончания = КонецДня(Дата(Запрос.ПараметрыЗапроса.Получить("dk")));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Списание.Дата КАК ДатаДокумента,
		|	Списание.Склад.КодВ77 КАК Склад,
		|	СписаниеПробы.НаименованиеПроб.Наименование КАК Наименование,
		|	СписаниеПробы.НомерПартии КАК НомерПартии,
		|	СписаниеПробы.ВесПробы КАК Количество,
		|	СписаниеПробы.ЦельИсследования.Наименование КАК ЦельИсследования,
		|	Списание.Номер КАК НомерДокумента
		|ИЗ
		|	Документ.Списание.Пробы КАК СписаниеПробы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Списание КАК Списание
		|		ПО СписаниеПробы.Ссылка = Списание.Ссылка
		|ГДЕ
		|	Списание.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Списание.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку(); 
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина);
	МойXML.ЗаписатьОбъявлениеXML();
	
	ТипВсеДокументы = ФабрикаXDTO.Тип("http://www.sample-package.org","СписокСписания");
	ВсеДокументы = ФабрикаXDTO.Создать(ТипВсеДокументы);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипОдинДокумент = ФабрикаXDTO.Тип("http://www.sample-package.org","ДокументСписания");
		ОдинДокумент = ФабрикаXDTO.Создать(ТипОдинДокумент);
		ЗаполнитьЗначенияСвойств(ОдинДокумент, ВыборкаДетальныеЗаписи);
		ВсеДокументы.ДокументСписания.Добавить(ОдинДокумент);
	КонецЦикла;
	ФабрикаXDTO.ЗаписатьXML(МойXML, ВсеДокументы);
	СтрокаОтвета =  МойXML.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, "UTF-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/xml");
	Возврат Ответ;
КонецФункции

#КонецОбласти
